#include "get_fun_to_one.h"
/*----------------------------------------------------
Заполнение масссива рамкой и пробелами внутри.
-----------------------------------------------------*/
void init_mas(char** matrix) {
    for (int i = 0; i < height; i++) {
        for (int j = 0; j < width; j++) {
            matrix[i][j] = '.';
        }
    }
}

/*-----------------------------------------------------
Показ массива в консоли.
------------------------------------------------------*/
void consol_show(char** matrix) {
    for (int i = 0; i < height; i++) {
        for (int j = 0; j < width; j ++) {
            printf("%c", matrix[i][j]);
        }
        printf("\n");
    }
}

/*-----------------------------------------------------
Меняем матрицу
------------------------------------------------------*/
